---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsValid
source: html/a69ecfb8-6130-33d3-79bc-9905686298a0.htm
---
# Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsValid Method

Checks that the RebarConstrainedHandle still has access to valid Rebar handle data
 and that its RebarConstraintsManager is still valid.

## Syntax (C#)
```csharp
public bool IsValid()
```